CSI API ETABS v1
cSapModel.PatternDef Property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
cPattern PatternDef { get; }
ReadOnly Property PatternDef As cPattern
	Get
Dim instance As cSapModel
Dim value As cPattern
value = instance.PatternDef
property cPattern^ PatternDef {
	cPattern^ get ();
}
abstract PatternDef : cPattern with get
Property Value
Type: cPattern
See Also
Reference
cSapModel Interface
ETABSv1 Namespace